vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_СрокиИзготовленияВПиРиски</Name>
			<Comment>ЛТ3.1</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокБазовыйДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РискУвеличенияСрокаДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРабочегоЦентра</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыРабочихЦентров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВоеннаяПродукция</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

vlm/base/InformationRegisters/бит_СрокиИзготовленияВПиРиски/Forms/ФормаЗаписи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запись.ДатаДобавления = ТекущаяДатаСеанса();
	Запись.Пользователь = Пользователи.АвторизованныйПользователь();
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
	Запись.ВидРабочегоЦентра = ПолучитьВидРЦ();
КонецПроцедуры      

&НаСервере
Функция ПолучитьВидРЦ()
	
	ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
	Если ЗначениеЗаполнено(Запись.Номенклатура) Тогда
		Спецификация = бит_ОбщегоНазначенияСервер.СпецификацияНоменклатуры(Запись.Номенклатура, Запись.ДатаДобавления);
		Операция = Неопределено;
		бит_ОбщегоНазначенияСервер.ПолучитьПоследниеЭтапОперацияПоСпецификации(Спецификация, , Операция);
		Если Операция <> Неопределено Тогда
			ВидРабочегоЦентра = Операция.РабочийЦентр;
		Иначе                   
			ВидРабочегоЦентра = Справочники.ВидыРабочихЦентров.ПустаяСсылка();
		КонецЕсли;
	КонецЕсли;
	
	Возврат ВидРабочегоЦентра;
	
КонецФункции
